Revit 2027 API
StructuralSectionGeneralLZ.BottomFlangeLength Property
 Bottom Flange segment length.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BottomFlangeLength { get; set; }
Public Property BottomFlangeLength As Double
	Get
	Set
public:
property double BottomFlangeLength {
	double get ();
	void set (double value);
}
member BottomFlangeLength : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionGeneralLZ Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace